GopalSaraf/Practicals/PSDL/include/proc/pic16lf19156.inc
// Register: SECONDS
#define SECONDS SECONDS
SECONDS                                  equ 0C16h
// bitfield definitions
SECONDS_SECL_POSN                        equ 0000h
SECONDS_SECL_POSITION                    equ 0000h
SECONDS_SECL_SIZE                        equ 0004h
SECONDS_SECL_LENGTH                      equ 0004h
SECONDS_SECL_MASK                        equ 000Fh
SECONDS_SECH_POSN                        equ 0004h
SECONDS_SECH_POSITION                    equ 0004h
SECONDS_SECH_SIZE                        equ 0003h
SECONDS_SECH_LENGTH                      equ 0003h
SECONDS_SECH_MASK                        equ 0070h
SECONDS_SECL0_POSN                       equ 0000h
SECONDS_SECL0_POSITION                   equ 0000h
SECONDS_SECL0_SIZE                       equ 0001h
SECONDS_SECL0_LENGTH                     equ 0001h
SECONDS_SECL0_MASK                       equ 0001h
SECONDS_SECL1_POSN                       equ 0001h
SECONDS_SECL1_POSITION                   equ 0001h
SECONDS_SECL1_SIZE                       equ 0001h
SECONDS_SECL1_LENGTH                     equ 0001h
SECONDS_SECL1_MASK                       equ 0002h
SECONDS_SECL2_POSN                       equ 0002h
SECONDS_SECL2_POSITION                   equ 0002h
SECONDS_SECL2_SIZE                       equ 0001h
SECONDS_SECL2_LENGTH                     equ 0001h
SECONDS_SECL2_MASK                       equ 0004h
SECONDS_SECL3_POSN                       equ 0003h
SECONDS_SECL3_POSITION                   equ 0003h
SECONDS_SECL3_SIZE                       equ 0001h
SECONDS_SECL3_LENGTH                     equ 0001h
SECONDS_SECL3_MASK                       equ 0008h
SECONDS_SECH0_POSN                       equ 0004h
SECONDS_SECH0_POSITION                   equ 0004h
SECONDS_SECH0_SIZE                       equ 0001h
SECONDS_SECH0_LENGTH                     equ 0001h
SECONDS_SECH0_MASK                       equ 0010h
SECONDS_SECH1_POSN                       equ 0005h
SECONDS_SECH1_POSITION                   equ 0005h
SECONDS_SECH1_SIZE                       equ 0001h
SECONDS_SECH1_LENGTH                     equ 0001h
SECONDS_SECH1_MASK                       equ 0020h
SECONDS_SECH2_POSN                       equ 0006h
SECONDS_SECH2_POSITION                   equ 0006h
SECONDS_SECH2_SIZE                       equ 0001h
SECONDS_SECH2_LENGTH                     equ 0001h
SECONDS_SECH2_MASK                       equ 0040h

// Register: ALRMMTH
#define ALRMMTH ALRMMTH
ALRMMTH                                  equ 0C17h
// bitfield definitions
ALRMMTH_ALRMLMONTH_POSN                  equ 0000h
ALRMMTH_ALRMLMONTH_POSITION              equ 0000h
ALRMMTH_ALRMLMONTH_SIZE                  equ 0004h
ALRMMTH_ALRMLMONTH_LENGTH                equ 0004h
ALRMMTH_ALRMLMONTH_MASK                  equ 000Fh
ALRMMTH_ALRMHMONTH_POSN                  equ 0004h
ALRMMTH_ALRMHMONTH_POSITION              equ 0004h
ALRMMTH_ALRMHMONTH_SIZE                  equ 0001h
ALRMMTH_ALRMHMONTH_LENGTH                equ 0001h
ALRMMTH_ALRMHMONTH_MASK                  equ 0010h
ALRMMTH_ALRMLMONTH0_POSN                 equ 0000h
ALRMMTH_ALRMLMONTH0_POSITION             equ 0000h
ALRMMTH_ALRMLMONTH0_SIZE                 equ 0001h
ALRMMTH_ALRMLMONTH0_LENGTH               equ 0001h
ALRMMTH_ALRMLMONTH0_MASK                 equ 0001h
ALRMMTH_ALRMLMONTH1_POSN                 equ 0001h
ALRMMTH_ALRMLMONTH1_POSITION             equ 0001h
ALRMMTH_ALRMLMONTH1_SIZE                 equ 0001h
ALRMMTH_ALRMLMONTH1_LENGTH               equ 0001h
ALRMMTH_ALRMLMONTH1_MASK                 equ 0002h
ALRMMTH_ALRMLMONTH2_POSN                 equ 0002h
ALRMMTH_ALRMLMONTH2_POSITION             equ 0002h
ALRMMTH_ALRMLMONTH2_SIZE                 equ 0001h
ALRMMTH_ALRMLMONTH2_LENGTH               equ 0001h
ALRMMTH_ALRMLMONTH2_MASK                 equ 0004h
ALRMMTH_ALRMLMONTH3_POSN                 equ 0003h
ALRMMTH_ALRMLMONTH3_POSITION             equ 0003h
ALRMMTH_ALRMLMONTH3_SIZE                 equ 0001h
ALRMMTH_ALRMLMONTH3_LENGTH               equ 0001h
ALRMMTH_ALRMLMONTH3_MASK                 equ 0008h

// Register: ALRMWD
#define ALRMWD ALRMWD
ALRMWD                                   equ 0C18h
// bitfield definitions
ALRMWD_ALRMLWDAY_POSN                    equ 0000h
ALRMWD_ALRMLWDAY_POSITION                equ 0000h
ALRMWD_ALRMLWDAY_SIZE                    equ 0003h
ALRMWD_ALRMLWDAY_LENGTH                  equ 0003h
ALRMWD_ALRMLWDAY_MASK                    equ 0007h
ALRMWD_ALRMLWDAY0_POSN                   equ 0000h
ALRMWD_ALRMLWDAY0_POSITION               equ 0000h
ALRMWD_ALRMLWDAY0_SIZE                   equ 0001h
ALRMWD_ALRMLWDAY0_LENGTH                 equ 0001h
ALRMWD_ALRMLWDAY0_MASK                   equ 0001h
ALRMWD_ALRMLWDAY1_POSN                   equ 0001h
ALRMWD_ALRMLWDAY1_POSITION               equ 0001h
ALRMWD_ALRMLWDAY1_SIZE                   equ 0001h
ALRMWD_ALRMLWDAY1_LENGTH                 equ 0001h
ALRMWD_ALRMLWDAY1_MASK                   equ 0002h
ALRMWD_ALRMLWDAY2_POSN                   equ 0002h
ALRMWD_ALRMLWDAY2_POSITION               equ 0002h
ALRMWD_ALRMLWDAY2_SIZE                   equ 0001h
ALRMWD_ALRMLWDAY2_LENGTH                 equ 0001h
ALRMWD_ALRMLWDAY2_MASK                   equ 0004h

// Register: ALRMDAY
#define ALRMDAY ALRMDAY
ALRMDAY                                  equ 0C19h
// bitfield definitions
ALRMDAY_ALRMLDAY_POSN                    equ 0000h
ALRMDAY_ALRMLDAY_POSITION                equ 0000h
ALRMDAY_ALRMLDAY_SIZE                    equ 0004h
ALRMDAY_ALRMLDAY_LENGTH                  equ 0004h
ALRMDAY_ALRMLDAY_MASK                    equ 000Fh
ALRMDAY_ALRMHDAY_POSN                    equ 0004h
ALRMDAY_ALRMHDAY_POSITION                equ 0004h
ALRMDAY_ALRMHDAY_SIZE                    equ 0002h
ALRMDAY_ALRMHDAY_LENGTH                  equ 0002h
ALRMDAY_ALRMHDAY_MASK                    equ 0030h
ALRMDAY_ALRMLDAY0_POSN                   equ 0000h
ALRMDAY_ALRMLDAY0_POSITION               equ 0000h
ALRMDAY_ALRMLDAY0_SIZE                   equ 0001h
ALRMDAY_ALRMLDAY0_LENGTH                 equ 0001h
ALRMDAY_ALRMLDAY0_MASK                   equ 0001h
ALRMDAY_ALRMLDAY1_POSN                   equ 0001h
ALRMDAY_ALRMLDAY1_POSITION               equ 0001h
ALRMDAY_ALRMLDAY1_SIZE                   equ 0001h
ALRMDAY_ALRMLDAY1_LENGTH                 equ 0001h
ALRMDAY_ALRMLDAY1_MASK                   equ 0002h
ALRMDAY_ALRMLDAY2_POSN                   equ 0002h
ALRMDAY_ALRMLDAY2_POSITION               equ 0002h
ALRMDAY_ALRMLDAY2_SIZE                   equ 0001h
ALRMDAY_ALRMLDAY2_LENGTH                 equ 0001h
ALRMDAY_ALRMLDAY2_MASK                   equ 0004h
ALRMDAY_ALRMLDAY3_POSN                   equ 0003h
ALRMDAY_ALRMLDAY3_POSITION               equ 0003h
ALRMDAY_ALRMLDAY3_SIZE                   equ 0001h
ALRMDAY_ALRMLDAY3_LENGTH                 equ 0001h
ALRMDAY_ALRMLDAY3_MASK                   equ 0008h
ALRMDAY_ALRMHDAY0_POSN                   equ 0004h
ALRMDAY_ALRMHDAY0_POSITION               equ 0004h
ALRMDAY_ALRMHDAY0_SIZE                   equ 0001h
ALRMDAY_ALRMHDAY0_LENGTH                 equ 0001h
ALRMDAY_ALRMHDAY0_MASK                   equ 0010h
ALRMDAY_ALRMHDAY1_POSN                   equ 0005h
ALRMDAY_ALRMHDAY1_POSITION               equ 0005h
ALRMDAY_ALRMHDAY1_SIZE                   equ 0001h
ALRMDAY_ALRMHDAY1_LENGTH                 equ 0001h
ALRMDAY_ALRMHDAY1_MASK                   equ 0020h

// Register: ALRMHR
#define ALRMHR ALRMHR
ALRMHR                                   equ 0C1Ah
// bitfield definitions
ALRMHR_ALRMLHR_POSN                      equ 0000h
ALRMHR_ALRMLHR_POSITION                  equ 0000h
ALRMHR_ALRMLHR_SIZE                      equ 0004h
ALRMHR_ALRMLHR_LENGTH                    equ 0004h
ALRMHR_ALRMLHR_MASK                      equ 000Fh
ALRMHR_ALRMHHR_POSN                      equ 0004h
ALRMHR_ALRMHHR_POSITION                  equ 0004h
ALRMHR_ALRMHHR_SIZE                      equ 0002h
ALRMHR_ALRMHHR_LENGTH                    equ 0002h
ALRMHR_ALRMHHR_MASK                      equ 0030h
ALRMHR_ALRMLHR0_POSN                     equ 0000h
ALRMHR_ALRMLHR0_POSITION                 equ 0000h
ALRMHR_ALRMLHR0_SIZE                     equ 0001h
ALRMHR_ALRMLHR0_LENGTH                   equ 0001h
ALRMHR_ALRMLHR0_MASK                     equ 0001h
ALRMHR_ALRMLHR1_POSN                     equ 0001h
ALRMHR_ALRMLHR1_POSITION                 equ 0001h
ALRMHR_ALRMLHR1_SIZE                     equ 0001h
ALRMHR_ALRMLHR1_LENGTH                   equ 0001h
ALRMHR_ALRMLHR1_MASK                     equ 0002h
ALRMHR_ALRMLHR2_POSN                     equ 0002h
ALRMHR_ALRMLHR2_POSITION                 equ 0002h
ALRMHR_ALRMLHR2_SIZE                     equ 0001h
ALRMHR_ALRMLHR2_LENGTH                   equ 0001h
ALRMHR_ALRMLHR2_MASK                     equ 0004h
ALRMHR_ALRMLHR3_POSN                     equ 0003h
ALRMHR_ALRMLHR3_POSITION                 equ 0003h
ALRMHR_ALRMLHR3_SIZE                     equ 0001h
ALRMHR_ALRMLHR3_LENGTH                   equ 0001h
ALRMHR_ALRMLHR3_MASK                     equ 0008h
ALRMHR_ALRMHHR0_POSN                     equ 0004h
ALRMHR_ALRMHHR0_POSITION                 equ 0004h
ALRMHR_ALRMHHR0_SIZE                     equ 0001h
ALRMHR_ALRMHHR0_LENGTH                   equ 0001h
ALRMHR_ALRMHHR0_MASK                     equ 0010h
ALRMHR_ALRMHHR1_POSN                     equ 0005h
ALRMHR_ALRMHHR1_POSITION                 equ 0005h
ALRMHR_ALRMHHR1_SIZE                     equ 0001h
ALRMHR_ALRMHHR1_LENGTH                   equ 0001h
ALRMHR_ALRMHHR1_MASK                     equ 0020h

// Register: ALRMMIN
#define ALRMMIN ALRMMIN
ALRMMIN                                  equ 0C1Bh
// bitfield definitions
ALRMMIN_ALRMLMIN_POSN                    equ 0000h
ALRMMIN_ALRMLMIN_POSITION                equ 0000h
ALRMMIN_ALRMLMIN_SIZE                    equ 0004h
ALRMMIN_ALRMLMIN_LENGTH                  equ 0004h
ALRMMIN_ALRMLMIN_MASK                    equ 000Fh
ALRMMIN_ALRMHMIN_POSN                    equ 0004h
ALRMMIN_ALRMHMIN_POSITION                equ 0004h
ALRMMIN_ALRMHMIN_SIZE                    equ 0003h
ALRMMIN_ALRMHMIN_LENGTH                  equ 0003h
ALRMMIN_ALRMHMIN_MASK                    equ 0070h
ALRMMIN_ALRMLMIN0_POSN                   equ 0000h
ALRMMIN_ALRMLMIN0_POSITION               equ 0000h
ALRMMIN_ALRMLMIN0_SIZE                   equ 0001h
ALRMMIN_ALRMLMIN0_LENGTH                 equ 0001h
ALRMMIN_ALRMLMIN0_MASK                   equ 0001h
ALRMMIN_ALRMLMIN1_POSN                   equ 0001h
ALRMMIN_ALRMLMIN1_POSITION               equ 0001h
ALRMMIN_ALRMLMIN1_SIZE                   equ 0001h
ALRMMIN_ALRMLMIN1_LENGTH                 equ 0001h
ALRMMIN_ALRMLMIN1_MASK                   equ 0002h
ALRMMIN_ALRMLMIN2_POSN                   equ 0002h
ALRMMIN_ALRMLMIN2_POSITION               equ 0002h
ALRMMIN_ALRMLMIN2_SIZE                   equ 0001h
ALRMMIN_ALRMLMIN2_LENGTH                 equ 0001h
ALRMMIN_ALRMLMIN2_MASK                   equ 0004h
ALRMMIN_ALRMLMIN3_POSN                   equ 0003h
ALRMMIN_ALRMLMIN3_POSITION               equ 0003h
ALRMMIN_ALRMLMIN3_SIZE                   equ 0001h
ALRMMIN_ALRMLMIN3_LENGTH                 equ 0001h
ALRMMIN_ALRMLMIN3_MASK                   equ 0008h
ALRMMIN_ALRMHMIN0_POSN                   equ 0004h
ALRMMIN_ALRMHMIN0_POSITION               equ 0004h
ALRMMIN_ALRMHMIN0_SIZE                   equ 0001h
ALRMMIN_ALRMHMIN0_LENGTH                 equ 0001h
ALRMMIN_ALRMHMIN0_MASK                   equ 0010h
ALRMMIN_ALRMHMIN1_POSN                   equ 0005h
ALRMMIN_ALRMHMIN1_POSITION               equ 0005h
ALRMMIN_ALRMHMIN1_SIZE                   equ 0001h
ALRMMIN_ALRMHMIN1_LENGTH                 equ 0001h
ALRMMIN_ALRMHMIN1_MASK                   equ 0020h
ALRMMIN_ALRMHMIN2_POSN                   equ 0006h
ALRMMIN_ALRMHMIN2_POSITION               equ 0006h
ALRMMIN_ALRMHMIN2_SIZE                   equ 0001h
ALRMMIN_ALRMHMIN2_LENGTH                 equ 0001h
ALRMMIN_ALRMHMIN2_MASK                   equ 0040h

